public/archive/backup/how-to-create-this-site.org
#+SETUPFILE: /Users/kbusi/devel/org-html-themes/setup/theme-readtheorg.setup
#+TITLE: How to create this site using org mode

* Introduction
  If you use emacs org mode to stay organized, sooner or later, there will be 
  a requirement to publish your org files to html.
 
  In html you can view the notes in your browser, deploy them to the web and 
  share the site with anyone not into org mode.

* Requirements
  - use emacs
  - use org mode > version 8.0
    To check, M-x org-version
    Emacs 24 should come with org mode 8
  - convert org mode files to html


* How to

** Clone the org-html-themes repository
   Link: https://github.com/fniessen/org-html-themes


** Create an org file with the setup line on top
#+BEGIN_SRC org
#+SETUPFILE: /path/to/org-html-themes/setup/theme-readtheorg.setup
#+TITLE: Title of my Org file
#+END_SRC


** Export org file to html
#+BEGIN_SRC org
M-x org-html-export-to-html
#+END_SRC

- A html file will be created in the same directory as the org file
- The html file should be viewable offline

** Deploy the HTML file to any webserver
