archive/backup/how-to-create-this-site.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-09-02 Wed 15:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>How to create this site using org mode</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="kiran" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">How to create this site using org mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline2">2. Requirements</a></li>
<li><a href="#orgheadline7">3. How to</a>
<ul>
<li><a href="#orgheadline3">3.1. Clone the org-html-themes repository</a></li>
<li><a href="#orgheadline4">3.2. Create an org file with the setup line on top</a></li>
<li><a href="#orgheadline5">3.3. Export org file to html</a></li>
<li><a href="#orgheadline6">3.4. Deploy the HTML file to any webserver</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
If you use emacs org mode to stay organized, sooner or later, there will be 
a requirement to publish your org files to html.
</p>

<p>
In html you can view the notes in your browser, deploy them to the web and 
share the site with anyone not into org mode.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Requirements</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>use emacs</li>
<li>use org mode &gt; version 8.0
To check, M-x org-version
Emacs 24 should come with org mode 8</li>
<li>convert org mode files to html</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">3</span> How to</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> Clone the org-html-themes repository</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Link: <a href="https://github.com/fniessen/org-html-themes">https://github.com/fniessen/org-html-themes</a>
</p>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">3.2</span> Create an org file with the setup line on top</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-org">#+SETUPFILE: /path/to/org-html-themes/setup/theme-readtheorg.setup
#+TITLE: Title of my Org file
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">3.3</span> Export org file to html</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-org">M-x org-html-export-to-html
</pre>
</div>

<ul class="org-ul">
<li>A html file will be created in the same directory as the org file</li>
<li>The html file should be viewable offline</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">3.4</span> Deploy the HTML file to any webserver</h3>
</div>
</div>
</div>
</body>
</html>
